Repository: OSGeo-jp/OSGeoLive-doc-omegat
Catalog: tm/quickstart--usb_quickstart.tmx
Source language: en
Languages: ja

source: Creating an OSGeoLive Bootable USB flash drive
ja: OSGeoLive を起動できる ブータブル USB フラッシュドライブの作成

source: This quickstart describes the preferred method for creating a Bootable OSGeoLive USB flash drive. Booting from a flash drive is faster than from a DVD, and the USB drive can be configured to store data between sessions (called persistence).
ja: ここでは、OSGeoLive のブータブル (起動できる) USB フラッシュドライブを作る方法について記載します。フラッシュドライブからの起動は DVD から起動するよりも速く動作し、フラッシュドライブではセッションを超えてデータを保存することもできます。

source: We have found that there are a number of quirks and tricks involved in successfully building a USB drive. We have documented what we know, but there are likely more tricks and issues. Look for latest tips here: https://wiki.osgeo.org/wiki/Live_GIS_Disc_Quick_Start_for_USB
ja: USBドライブを正常に構築するためには、さまざまな工夫が必要です。私たちは知っていることを文書化しましたが、おそらくもっと多くのトリックと問題があります。ここで最新のヒントを探してください: https://wiki.osgeo.org/wiki/Live_GIS_Disc_Quick_Start_for_USB

source: Requirements
ja: 必要なもの

source: A USB flash drive (at least 4 Gig, 8+ Gig is recommended).
ja: USB フラッシュドライブ (最低 4 GB、推奨 8 GB 以上)。

source: An OSGeoLive ISO image (downloaded from: :doc:`OSGeoLive downloads <../download>`) or converted from a DVD.
ja: OSGeoLive ISOイメージ(: :doc:`OSGeoLive downloads <../download>`からダウンロード)またはDVDから変換されたもの。

source: For a 4 GB USB flash drive, use osgeolive-mini ISO (without Windows and Mac installers), without persistence.
ja: 4 GB USB フラッシュドライブ用には、osgeolive-mini ISO を使用 (WindowsとMac向けのインストーラーを含まない)、永続性は非サポート。

source: For a 8+ GB USB flash drive, use either osgeolive-mini ISO, or osgeolive ISO (with Windows and Mac installers). 8+ GB is recommended if you wish to support persistence.
ja: 8 GB 以上の USB フラッシュドライブ用には、osgeolive-mini ISO か osgeolive ISO のどちらかを使用 (WindowsとMac向けのインストーラーを含む)、永続性をサポートする場合は 8 GB 以上を推奨。

source: Creating bootable USB drive with ``dd`` under Linux
ja: Linux 環境でブータブル USB ドライブの作成

source: ISO images for OSGeoLive 10.5 and later are *isohybrid* (and for amd64, also support UEFI boot). Under Linux, these images can be written directly to the block device for a USB drive with the ``dd`` command-line utility:
ja: OS GeoLive10.5以降のISOイメージは*isohybrid*です(amd64もサポートUEFIブート)。Linuxでは、``dd``コマンドラインユーティリティを使用して、これらのイメージをUSBドライブのブロックデバイスに直接書き込むことができます。

source: ``/dev/sdX`` is the block device for the USB drive, where ``X`` might be ``b`` or ``c``.
ja: ``/dev/sdX``はUSBドライブのブロックデバイスで、``X``は``b``または``c``かもしれません。

source: Use ``lsblk`` to list block devices and ``dmesg`` to see kernel messages identifying the USB drive when it is connected.
ja: ``lsblk``を使用してブロックデバイスを一覧表示し、``dmesg``を使用して接続時にUSBドライブを識別するカーネルメッセージを表示します。

source: The USB drive should not be mounted.
ja: USBドライブはマウントされていないようにしてください。

source: ``sudo`` is not required if the command is run as ``root``.
ja: ``sudo``は、``root``としてコマンド実行している場合は必要ありません。

source: Be certain to select the correct block device as ``dd`` will overwrite it without question, even if it is your primary system drive.
ja: ``dd``は、たとえプライマリシステムドライブであっても、問題なく上書きするので、正しいブロックデバイスを選択してください。

source: Creating bootable USB drive with Ubuntu Startup Disk Creator
ja: Ubuntu Startup Disk Creatorを使用したブータブルUSBドライブの作成

source: (This is the recommended process for creating a USB. It is applicable to Ubuntu and Ubuntu variants such as OSGeoLive.)
ja: (これはUSBを作成するための推奨プロセスです。UbuntuやOSGeoLiveなどのUbuntuバージョンにも適用されます。)

source: The version of Ubuntu you are running, needs to be the same or newer than the version of Lubuntu being installed onto your USB. If installing OSGeoLive 8.0 onto a USB, then you will need to be running Ubuntu 14.04 or newer.
ja: 実行しているUbuntuのバージョンは、USBにインストールされているUbuntuのバージョンと同じか新しい必要があります。OS GeoLive8.0をUSBにインストールする場合は、Ubuntu14.04以降を実行している必要があります。

source: :doc:`Download <../download>` osgeolive or osgeolive-mini to your computer's hard drive.
ja: osgeoliveまたはosgeolive-miniをコンピュータのハードディスクに :doc:`ダウンロード <../download>`してください。

source: Boot your computer into a recent Ubuntu/Xbuntu distribution. You can do this by running from an OSGeoLive DVD, as explained in :doc:`osgeolive_quickstart`.
ja: 最新のUbuntu/Xbuntuディストリビューションでコンピュータを起動します。これは、:doc:`osgeolive_クイックスタート`で説明されているように、OSGeoLive DVDから実行すること実行できます。

source: Insert the USB flash drive into your computer.
ja: USBフラッシュドライブをコンピュータに挿入します。

source: Select :menuselection:`System Tools --> Startup Disk Creator`, or search for `Startup Disk Creator` from the Unity desktop.
ja: :menuselection:`System Tools-->Startup Disk Creator`を選択するか、デスクトップから`Startup Disk Creator`を検索します。

source: Select the osgeolive or osgeolive-mini ISO Image that you downloaded earlier.
ja: 先ほどダウンロードしたosgeoliveまたはosgeolive-mini ISOイメージを選択します。

source: Select the USB flash drive. If you have extra room you might adjust the slider to create persistent storage space on the USB drive (recommended). In order for this option to be available you will need an 8+ GB USB flash drive.
ja: USBフラッシュドライブを選択します。余裕がある場合は、スライダーを調整してUSBドライブに永続的なストレージスペースを作成することをお勧めします(推奨)。このオプションを利用するには、8GB以上のUSBフラッシュドライブが必要です。

source: Select :guilabel:`Make Startup Disk`
ja: :guilabel:`Make Startup Disk`を選択します。

source: Wait 20 minutes or so for the USB flash drive to be created.
ja: USBフラッシュドライブが作成されるまで20分ほど待ちます。

source: Booting from the USB drive:
ja: USBドライブから起動中:

source: Start with the computer off.
ja: コンピュータをオフにして起動します。

source: Insert the USB drive into an open USB port.
ja: 開いているUSBポートにUSBドライブを挿入します。

source: Power on the Machine and select to boot from USB:
ja: マシンの電源を入れ、USBから起動するように選択します。

source: Most computers are not set to boot from a USB drive by default.
ja: ほとんどのコンピュータは、デフォルトではUSBドライブから起動するように設定されていません。

source: When booting, look for a message indicating a Boot Menu (most commonly you press F12)
ja: 起動時に、起動メニューを示すメッセージを探します(通常はF12を押します)

source: If your computer does not have a boot menu, then boot into your system BIOS. The button to enter BIOS varies by brand and model of computer. If you can't figure out yours try this website that lists many BIOS hotkeys. https://www.mydigitallife.net/comprehensive-list-of-how-key-to-press-to-access-bios-for-various-oem-and-computer-systems/
ja: コンピュータに起動メニューがない場合は、システムBIOSで起動します。BIOSに入るボタンは、コンピュータのブランドとモデルによって異なります。あなたのBIOSがわからない場合は、多くのBIOSホットキーがリストされているこのWebサイトを試してください。https://www.mydigitallife.net/comprehensive-list-of-how-key-to-press-to-access-bios-for-various-oem-and-computer-systems/

source: Select to boot from the USB device.
ja: 選択してUSBデバイスから起動します。

source: Note, that for some computers you will need to have the USB drive inserted into the computer in order to select it.
ja: 一部のコンピュータでは、USBドライブをコンピュータに挿入して選択する必要があります。

source: Note also, the USB drive is often listed under hard drives rather than removable devices.
ja: また、USBドライブは多くの場合、取り外し可能なデバイスではなくハードドライブに表示されます。

source: This `Video <https://www.youtube.com/watch?v=eQBdVO-n6Mg>`_ demonstrates booting from USB.
ja: この`ビデオ<https://www.youtube.com/watch?v=eQBdVO-n6Mg>`_は、USBからの起動を示しています。

source: Run:
ja: 実行

source: See Also:
ja: 参照:

source: Alternative USB creation methods and latest tips are collected here: `wiki <https://wiki.osgeo.org/wiki/Live_GIS_Disc_Quick_Start_for_USB>`_
ja: 代替のUSB作成方法と最新のヒントは、次の場所に集められています:`wiki<https://wiki.osgeo.org/wiki/Live_GIS_Disc_Quick_Start_for_USB>`_

source: Questions can be directed to our email list: https://lists.osgeo.org/pipermail/osgeolive/
ja: 質問は、メイリングリストに送ることができます: https://lists.osgeo.org/pipermail/osgeolive/
